Ran Plan for 4 projects:

1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
1. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
1. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
1. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`

### 1. project: `frontend_amer_autoscale` dir: `frontend/gcp_autoscale` workspace: `amer`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_compute_address.asg[0] must be replaced
-/+ resource "google_compute_address" "asg" {
      ~ address            = "34.125.73.159" -> (known after apply)
        address_type       = "EXTERNAL"
      ~ creation_timestamp = "2020-09-22T15:44:16.543-07:00" -> (known after apply)
      ~ id                 = "projects/2036174436/regions/us-west4/addresses/dmlc-autoscale-4f65d087981729fc" -> (known after apply)
      ~ name               = "dmlc-autoscale-4f65d087981729fc" -> (known after apply) # forces replacement
      ~ network_tier       = "PREMIUM" -> (known after apply)
      ~ project            = "2036174436" -> (known after apply)
      + purpose            = (known after apply)
        region             = "us-west4"
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west4/addresses/dmlc-autoscale-4f65d087981729fc" -> (known after apply)
      + subnetwork         = (known after apply)
      ~ users              = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west4/forwardingRules/asg-forwarding-rule-us-west4",
        ] -> (known after apply)
    }

  # google_compute_address.asg[1] must be replaced
-/+ resource "google_compute_address" "asg" {
      ~ address            = "35.221.46.43" -> (known after apply)
        address_type       = "EXTERNAL"
      ~ creation_timestamp = "2020-09-22T15:44:16.536-07:00" -> (known after apply)
      ~ id                 = "projects/2036174436/regions/us-east4/addresses/dmlc-autoscale-4f65d087981729fc" -> (known after apply)
      ~ name               = "dmlc-autoscale-4f65d087981729fc" -> (known after apply) # forces replacement
      ~ network_tier       = "PREMIUM" -> (known after apply)
      ~ project            = "2036174436" -> (known after apply)
      + purpose            = (known after apply)
        region             = "us-east4"
      ~ self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-east4/addresses/dmlc-autoscale-4f65d087981729fc" -> (known after apply)
      + subnetwork         = (known after apply)
      ~ users              = [
          - "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-east4/forwardingRules/asg-forwarding-rule-us-east4",
        ] -> (known after apply)
    }

  # google_compute_autoscaler.asg[0] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-22T15:45:03.515-07:00"
        id                 = "projects/2036174436/zones/us-west4-b/autoscalers/asg-amer-us-west4"
        name               = "asg-amer-us-west4"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/autoscalers/asg-amer-us-west4"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b/instanceGroupManagers/asg-group-manager-amer-us-west4" -> "projects/2036174436/zones/us-west4-b/instanceGroupManagers/asg-group-manager-amer-us-west4"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-west4-b"

        autoscaling_policy {
            cooldown_period = 60
            max_replicas    = 2
            min_replicas    = 2
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_autoscaler.asg[1] will be updated in-place
~ resource "google_compute_autoscaler" "asg" {
        creation_timestamp = "2020-09-22T15:45:03.544-07:00"
        id                 = "projects/2036174436/zones/us-east4-b/autoscalers/asg-amer-us-east4"
        name               = "asg-amer-us-east4"
        project            = "2036174436"
        self_link          = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-east4-b/autoscalers/asg-amer-us-east4"
      ~ target             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-east4-b/instanceGroupManagers/asg-group-manager-amer-us-east4" -> "projects/2036174436/zones/us-east4-b/instanceGroupManagers/asg-group-manager-amer-us-east4"
        zone               = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/zones/us-east4-b"

        autoscaling_policy {
            cooldown_period = 60
            max_replicas    = 2
            min_replicas    = 2
            mode            = "ON"

            cpu_utilization {
                target = 0.5
            }
        }
    }

  # google_compute_forwarding_rule.asg[0] must be replaced
-/+ resource "google_compute_forwarding_rule" "asg" {
      - all_ports             = false -> null
      - allow_global_access   = false -> null
      ~ creation_timestamp    = "2020-09-22T15:44:39.646-07:00" -> (known after apply)
      ~ id                    = "projects/2036174436/regions/us-west4/forwardingRules/asg-forwarding-rule-us-west4" -> (known after apply)
      ~ ip_address            = "34.125.73.159" -> (known after apply) # forces replacement
      ~ ip_protocol           = "TCP" -> (known after apply)
      + ip_version            = (known after apply)
        load_balancing_scheme = "EXTERNAL"
        name                  = "asg-forwarding-rule-us-west4"
      + network               = (known after apply)
      ~ network_tier          = "PREMIUM" -> (known after apply)
      ~ port_range            = "80-80" -> "80"
      - ports                 = [] -> null
      ~ project               = "2036174436" -> (known after apply)
        region                = "us-west4"
      ~ self_link             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west4/forwardingRules/asg-forwarding-rule-us-west4" -> (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
        target                = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-west4/targetPools/asg-target-pool-us-west4"
    }

  # google_compute_forwarding_rule.asg[1] must be replaced
-/+ resource "google_compute_forwarding_rule" "asg" {
      - all_ports             = false -> null
      - allow_global_access   = false -> null
      ~ creation_timestamp    = "2020-09-22T15:44:39.416-07:00" -> (known after apply)
      ~ id                    = "projects/2036174436/regions/us-east4/forwardingRules/asg-forwarding-rule-us-east4" -> (known after apply)
      ~ ip_address            = "35.221.46.43" -> (known after apply) # forces replacement
      ~ ip_protocol           = "TCP" -> (known after apply)
      + ip_version            = (known after apply)
        load_balancing_scheme = "EXTERNAL"
        name                  = "asg-forwarding-rule-us-east4"
      + network               = (known after apply)
      ~ network_tier          = "PREMIUM" -> (known after apply)
      ~ port_range            = "80-80" -> "80"
      - ports                 = [] -> null
      ~ project               = "2036174436" -> (known after apply)
        region                = "us-east4"
      ~ self_link             = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-east4/forwardingRules/asg-forwarding-rule-us-east4" -> (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
        target                = "https://www.googleapis.com/compute/v1/projects/heroic-muse-289316/regions/us-east4/targetPools/asg-target-pool-us-east4"
    }

  # google_dns_record_set.asg[0] will be updated in-place
~ resource "google_dns_record_set" "asg" {
        id           = "dmlc/frontend-asg.us-west4.dmlc.pw./A"
        managed_zone = "dmlc"
        name         = "frontend-asg.us-west4.dmlc.pw."
        project      = "2036174436"
      ~ rrdatas      = [
          - "34.125.73.159",
        ] -> (known after apply)
        ttl          = 300
        type         = "A"
    }

  # google_dns_record_set.asg[1] will be updated in-place
~ resource "google_dns_record_set" "asg" {
        id           = "dmlc/frontend-asg.us-east4.dmlc.pw./A"
        managed_zone = "dmlc"
        name         = "frontend-asg.us-east4.dmlc.pw."
        project      = "2036174436"
      ~ rrdatas      = [
          - "35.221.46.43",
        ] -> (known after apply)
        ttl          = 300
        type         = "A"
    }

  # google_dns_record_set.asg_main[0] will be destroyed
- resource "google_dns_record_set" "asg_main" {
      - id           = "dmlc/dmlc.pw./A" -> null
      - managed_zone = "dmlc" -> null
      - name         = "dmlc.pw." -> null
      - project      = "2036174436" -> null
      - rrdatas      = [
          - "34.125.73.159",
        ] -> null
      - ttl          = 300 -> null
      - type         = "A" -> null
    }

  # random_id.instance_id must be replaced
-/+ resource "random_id" "instance_id" {
      ~ b64         = "T2XQh5gXKfw" -> (known after apply)
      ~ b64_std     = "T2XQh5gXKfw=" -> (known after apply)
      ~ b64_url     = "T2XQh5gXKfw" -> (known after apply)
      ~ byte_length = 8 -> 4 # forces replacement
      ~ dec         = "5721208182434900476" -> (known after apply)
      ~ hex         = "4f65d087981729fc" -> (known after apply)
      ~ id          = "T2XQh5gXKfw" -> (known after apply)
    }

Plan: 5 to add, 4 to change, 6 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_amer_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Famer)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_amer_autoscale`
</details>

---
### 2. project: `frontend_asia_autoscale` dir: `frontend/gcp_autoscale` workspace: `asia`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_id.instance_id must be replaced
-/+ resource "random_id" "instance_id" {
      ~ b64         = "RLT99ZqBFB8" -> (known after apply)
      ~ b64_std     = "RLT99ZqBFB8=" -> (known after apply)
      ~ b64_url     = "RLT99ZqBFB8" -> (known after apply)
      ~ byte_length = 8 -> 4 # forces replacement
      ~ dec         = "4950861121687983135" -> (known after apply)
      ~ hex         = "44b4fdf59a81141f" -> (known after apply)
      ~ id          = "RLT99ZqBFB8" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_asia_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Fasia)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_asia_autoscale`
</details>

---
### 3. project: `frontend_ocea_autoscale` dir: `frontend/gcp_autoscale` workspace: `ocea`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_id.instance_id must be replaced
-/+ resource "random_id" "instance_id" {
      ~ b64         = "yis71_f3i0U" -> (known after apply)
      ~ b64_std     = "yis71/f3i0U=" -> (known after apply)
      ~ b64_url     = "yis71_f3i0U" -> (known after apply)
      ~ byte_length = 8 -> 4 # forces replacement
      ~ dec         = "14567803218424204101" -> (known after apply)
      ~ hex         = "ca2b3bd7f7f78b45" -> (known after apply)
      ~ id          = "yis71_f3i0U" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_ocea_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Focea)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_ocea_autoscale`
</details>

---
### 4. project: `frontend_euro_autoscale` dir: `frontend/gcp_autoscale` workspace: `euro`
<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_id.instance_id must be replaced
-/+ resource "random_id" "instance_id" {
      ~ b64         = "gImdi7cQyGY" -> (known after apply)
      ~ b64_std     = "gImdi7cQyGY=" -> (known after apply)
      ~ b64_url     = "gImdi7cQyGY" -> (known after apply)
      ~ byte_length = 8 -> 4 # forces replacement
      ~ dec         = "9262107332061481062" -> (known after apply)
      ~ hex         = "80899d8bb710c866" -> (known after apply)
      ~ id          = "gImdi7cQyGY" -> (known after apply)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p frontend_euro_autoscale`
* :put_litter_in_its_place: To **delete** this plan click [here](http://b2087ccfd9f7:4141/lock?id=dmalicia%252Fdm-terraform%252Ffrontend%252Fgcp_autoscale%252Feuro)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p frontend_euro_autoscale`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
